package com.example.kinopoisk;

public class Utils {
    public static final String FILM_1_TITLE = "1. Побег из шоушенка";
    public static final String FILM_1_DESCRIPTION = "The Shawshank Redemption. 1994";
    public static final String FILM_1_STORYLINE = "Бухгалтер Энди Дюфрейн обвинён в убийстве собственной жены и её любовника. Оказавшись в тюрьме под названием Шоушенк, он сталкивается с жестокостью и беззаконием, царящими по обе стороны решётки. Каждый, кто попадает в эти стены, становится их рабом до конца жизни. Но Энди, обладающий живым умом и доброй душой, находит подход как к заключённым, так и к охранникам, добиваясь их особого к себе расположения.";

    public static final String FILM_2_TITLE = "2. Зеленая миля";
    public static final String FILM_2_DESCRIPTION = "The Green Mile. 1999";
    public static final String FILM_2_STORYLINE = "Пол Эджкомб - начальник блока смертников в тюрьме «Холодная гора», каждый из узников которого однажды проходит «зеленую милю» по пути к месту казни. Пол повидал много заключённых и надзирателей за время работы. Однако гигант Джон Коффи, обвинённый в страшном преступлении, стал одним из самых необычных обитателей блока.";

    public static final String FILM_3_TITLE = "3. Форрест Гамп";
    public static final String FILM_3_DESCRIPTION = "Forrest Gump. 1994";
    public static final String FILM_3_STORYLINE = "От лица главного героя Форреста Гампа, слабоумного безобидного человека с благородным и открытым сердцем, рассказывается история его необыкновенной жизни.\n" +
            "\n" +
            "Фантастическим образом превращается он в известного футболиста, героя войны, преуспевающего бизнесмена. Он становится миллиардером, но остается таким же бесхитростным, глупым и добрым. Форреста ждет постоянный успех во всем, а он любит девочку, с которой дружил в детстве, но взаимность приходит слишком поздно.";

    public static final String FILM_4_TITLE = "4. Список Шиндлера";
    public static final String FILM_4_DESCRIPTION = "Schindler's List. 1993";
    public static final String FILM_4_STORYLINE = "Фильм рассказывает реальную историю загадочного Оскара Шиндлера, члена нацистской партии, преуспевающего фабриканта, спасшего во время Второй мировой войны почти 1200 евреев.";

    public static final String FILM_5_TITLE = "5. 1+1";
    public static final String FILM_5_DESCRIPTION = "Intouchables. 2011";
    public static final String FILM_5_STORYLINE = "Пострадав в результате несчастного случая, богатый аристократ Филипп нанимает в помощники человека, который менее всего подходит для этой работы, – молодого жителя предместья Дрисса, только что освободившегося из тюрьмы. Несмотря на то, что Филипп прикован к инвалидному креслу, Дриссу удается привнести в размеренную жизнь аристократа дух приключений.";

    public static final String FILM_6_TITLE = "6. Начало";
    public static final String FILM_6_DESCRIPTION = "Inception. 2010";
    public static final String FILM_6_STORYLINE = "Кобб – талантливый вор, лучший из лучших в опасном искусстве извлечения: он крадет ценные секреты из глубин подсознания во время сна, когда человеческий разум наиболее уязвим. Редкие способности Кобба сделали его ценным игроком в привычном к предательству мире промышленного шпионажа, но они же превратили его в извечного беглеца и лишили всего, что он когда-либо любил.\n" +
            "\n" +
            "И вот у Кобба появляется шанс исправить ошибки. Его последнее дело может вернуть все назад, но для этого ему нужно совершить невозможное – инициацию. Вместо идеальной кражи Кобб и его команда спецов должны будут провернуть обратное. Теперь их задача – не украсть идею, а внедрить ее. Если у них получится, это и станет идеальным преступлением.\n" +
            "\n" +
            "Но никакое планирование или мастерство не могут подготовить команду к встрече с опасным противником, который, кажется, предугадывает каждый их ход. Врагом, увидеть которого мог бы лишь Кобб.";

    public static final String FILM_7_TITLE = "7. Леон";
    public static final String FILM_7_DESCRIPTION = "Léon. 1994";
    public static final String FILM_7_STORYLINE = "Профессиональный убийца Леон неожиданно для себя самого решает помочь 11-летней соседке Матильде, семью которой убили коррумпированные полицейские.";

    public static final String FILM_8_TITLE = "8. Король Лев";
    public static final String FILM_8_DESCRIPTION = "The Lion King. 1994";
    public static final String FILM_8_STORYLINE = "У величественного Короля-Льва Муфасы рождается наследник по имени Симба. Уже в детстве любознательный малыш становится жертвой интриг своего завистливого дяди Шрама, мечтающего о власти.\n" +
            "\n" +
            "Симба познаёт горе утраты, предательство и изгнание, но в конце концов обретает верных друзей и находит любимую. Закалённый испытаниями, он в нелёгкой борьбе отвоёвывает своё законное место в «Круге жизни», осознав, что значит быть настоящим Королём.";

    public static final String FILM_9_TITLE = "9. Бойцовский клуб";
    public static final String FILM_9_DESCRIPTION = "Fight Club. 1999";
    public static final String FILM_9_STORYLINE = "Сотрудник страховой компании страдает хронической бессонницей и отчаянно пытается вырваться из мучительно скучной жизни. Однажды в очередной командировке он встречает некоего Тайлера Дёрдена — харизматического торговца мылом с извращенной философией. Тайлер уверен, что самосовершенствование — удел слабых, а единственное, ради чего стоит жить — саморазрушение.\n" +
            "\n" +
            "Проходит немного времени, и вот уже новые друзья лупят друг друга почем зря на стоянке перед баром, и очищающий мордобой доставляет им высшее блаженство. Приобщая других мужчин к простым радостям физической жестокости, они основывают тайный Бойцовский клуб, который начинает пользоваться невероятной популярностью.";

    public static final String FILM_10_TITLE = "10. Иван Васильевич меняет профессию";
    public static final String FILM_10_DESCRIPTION = "1973";
    public static final String FILM_10_STORYLINE = "Инженер-изобретатель Тимофеев сконструировал машину времени, которая соединила его квартиру с далеким шестнадцатым веком - точнее, с палатами государя Ивана Грозного. Туда-то и попадают тезка царя пенсионер-общественник Иван Васильевич Бунша и квартирный вор Жорж Милославский.\n" +
            "\n" +
            "На их место в двадцатом веке «переселяется» великий государь. Поломка машины приводит ко множеству неожиданных и забавных событий...";
}
